Revit 2026 API

# MaterialAppearanceAssetId Property

---

The ElementId of the AppearanceAssetElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId AppearanceAssetId { get; set; }
```
```vb
Public Property AppearanceAssetId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ AppearanceAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member AppearanceAssetId : ElementId with get, set
```

#### Property Value

ElementId The id of the AppearanceAssetElement, or InvalidElementId if the material does not have an associated appearance asset.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This is the id to the element that contains visual material information used for rendering. In some cases where the material is created without setting up custom render appearance properties (for example, when the material is created via an import, or when it is created by the API), this property will be InvalidElementId. In that situation the standard material properties such as Color and Transparency will dictate the appearance of the material during rendering.

#### Reference

Material Class

Autodesk.Revit.DB Namespace